# Pandas - Group by

In [2]:
import numpy as np
import pandas as pd

In [3]:
data ={
    'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Amy','Vanessa','Carl','Shara'],
    'Sales':[200,120,340,124,243,350]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Shara    350

In [7]:
byComp=df.groupby('Company')

In [13]:
byComp.sum()

             Person  Sales
Company
FB        CarlShara    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [19]:
byComp["Sales"].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [20]:
byComp["Sales"].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [22]:
byComp["Sales"].sum().loc['FB']

593

In [23]:
df.groupby('Company').mean("Sales").loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [24]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [25]:
byComp.max()

          Person  Sales
Company
FB         Shara    350
GOOG         Sam    200
MSFT     Vanessa    340

In [26]:
byComp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [28]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000